app/views/banks/show.html.erb


<% if @bank.bank_subsidiaries.any? %>
	<ul>
		<% @bank.bank_subsidiaries.each do |subsidiary| %>
---
SELECT "bank_subsidiaries".* FROM "bank_subsidiaries" WHERE "bank_subsidiaries"."bank_id" = ?  [["bank_id", 1]]
SELECT 1 AS one FROM "bank_subsidiaries" WHERE "bank_subsidiaries"."bank_id" = ? LIMIT ?  [["bank_id", 1], ["LIMIT", 1]]