app/controllers/bank_subsidiaries_controller.rb

SELECT "bank_subsidiaries".* FROM "bank_subsidiaries"
---
  def index
    @bank_subsidiaries = BankSubsidiary.all

SELECT "bank_subsidiaries".* FROM "bank_subsidiaries" WHERE "bank_subsidiaries"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_bank_subsidiary
      @bank_subsidiary = BankSubsidiary.find(params[:id])