app/controllers/banks_controller.rb

  def index
    @banks = Bank.all
---
SELECT "banks".* FROM "banks"

  def create
    @bank = Bank.new(bank_params)

    respond_to do |format|
      if @bank.save
---
INSERT INTO "banks" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "test"], ["created_at", "2020-04-19 00:25:53.340651"], ["updated_at", "2020-04-19 00:25:53.340651"]]

  def destroy
    @bank.destroy
---
DELETE FROM "banks" WHERE "banks"."id" = ?  [["id", 5]]

    def set_bank
      @bank = Bank.find(params[:id])
---
SELECT "banks".* FROM "banks" WHERE "banks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]